РП/src/Catalogs/СценарииПооперационногоПланирования/СценарииПооперационногоПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииПооперационногоПланирования</name>
  <tabularSections>
    <name>РабочиеЦентрыДобавить</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеЦентрыИсключить</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Catalogs/СценарииПооперационногоПланирования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ РабочиеЦентрыИсключитьЗаполненыКорректно(Отказ) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КритерииОптимизации");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РабочиеЦентрыИсключитьЗаполненыКорректно(Отказ)
	
	Результат = Истина;	
	
	ТекстЗапроса = ТекстЗапросаРабочиеЦентрыИсключитьЗаполненыКорректно();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("РабочиеЦентрыИсключить", РабочиеЦентрыИсключить.Выгрузить());
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		Если ВыборкаИтоги.Исключить Тогда
			
			Результат = Ложь;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Для вида рабочего центра ""%1"" все рабочие центры указаны в качестве исключаемых.';uk='Для виду робочого центру ""%1"" всі робочі центри зазначені в якості виключних.'"),
				ВыборкаИтоги.ВидРабочегоЦентраПредставление);
				
			СтрокаСОшибкой = РабочиеЦентрыИсключить.Найти(ВыборкаИтоги.ВидРабочегоЦентра, "ВидРабочегоЦентра");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"РабочиеЦентрыИсключить",
				СтрокаСОшибкой.НомерСтроки,
				"ВидРабочегоЦентра");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаРабочиеЦентрыИсключитьЗаполненыКорректно()
	
	Результат = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеЦентрыИсключить.ВидРабочегоЦентра,
	|	РабочиеЦентрыИсключить.РабочийЦентр
	|ПОМЕСТИТЬ РабочиеЦентрыИсключить
	|ИЗ
	|	&РабочиеЦентрыИсключить КАК РабочиеЦентрыИсключить
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеЦентры.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	РабочиеЦентры.ВидРабочегоЦентра.Представление,
	|	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	|	ВЫБОР
	|		КОГДА РабочиеЦентрыИсключить.РабочийЦентр ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Исключить
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РабочиеЦентрыИсключить КАК РабочиеЦентрыИсключить
	|		ПО РабочиеЦентры.Ссылка = РабочиеЦентрыИсключить.РабочийЦентр
	|			И РабочиеЦентры.ВидРабочегоЦентра = РабочиеЦентрыИсключить.ВидРабочегоЦентра
	|ГДЕ
	|	РабочиеЦентры.ВидРабочегоЦентра В
	|			(ВЫБРАТЬ
	|				РабочиеЦентрыИсключить.ВидРабочегоЦентра
	|			ИЗ
	|				РабочиеЦентрыИсключить)
	|ИТОГИ
	|	МИНИМУМ(Исключить)
	|ПО
	|	ВидРабочегоЦентра";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
